apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_saradc.h
#define APB_SARADC_APB_ADC_CLKM_CONF_REG          (DR_REG_APB_SARADC_BASE + 0x054)

/* APB_SARADC_CLK_SEL : R/W ;bitpos:[22:21] ;default: 2'b0 ; */

/* description: Set this bit to enable clk_apll */

#define APB_SARADC_CLK_SEL    0x00000003
#define APB_SARADC_CLK_SEL_M  ((APB_SARADC_CLK_SEL_V)<<(APB_SARADC_CLK_SEL_S))
#define APB_SARADC_CLK_SEL_V  0x3
#define APB_SARADC_CLK_SEL_S  21

/* APB_SARADC_CLK_EN : R/W ;bitpos:[20] ;default: 1'd0 ; */

/* description: */

#define APB_SARADC_CLK_EN    (BIT(20))
#define APB_SARADC_CLK_EN_M  (BIT(20))
#define APB_SARADC_CLK_EN_V  0x1
#define APB_SARADC_CLK_EN_S  20

/* APB_SARADC_CLKM_DIV_A : R/W ;bitpos:[19:14] ;default: 6'h0 ; */

/* description: Fractional clock divider denominator value */

#define APB_SARADC_CLKM_DIV_A    0x0000003F
#define APB_SARADC_CLKM_DIV_A_M  ((APB_SARADC_CLKM_DIV_A_V)<<(APB_SARADC_CLKM_DIV_A_S))
#define APB_SARADC_CLKM_DIV_A_V  0x3F
#define APB_SARADC_CLKM_DIV_A_S  14

/* APB_SARADC_CLKM_DIV_B : R/W ;bitpos:[13:8] ;default: 6'h0 ; */

/* description: Fractional clock divider numerator value */

#define APB_SARADC_CLKM_DIV_B    0x0000003F
#define APB_SARADC_CLKM_DIV_B_M  ((APB_SARADC_CLKM_DIV_B_V)<<(APB_SARADC_CLKM_DIV_B_S))
#define APB_SARADC_CLKM_DIV_B_V  0x3F
#define APB_SARADC_CLKM_DIV_B_S  8

/* APB_SARADC_CLKM_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'd4 ; */

/* description: Integral I2S clock divider value */

#define APB_SARADC_CLKM_DIV_NUM    0x000000FF
#define APB_SARADC_CLKM_DIV_NUM_M  ((APB_SARADC_CLKM_DIV_NUM_V)<<(APB_SARADC_CLKM_DIV_NUM_S))
#define APB_SARADC_CLKM_DIV_NUM_V  0xFF
#define APB_SARADC_CLKM_DIV_NUM_S  0

#define APB_SARADC_APB_TSENS_CTRL_REG          (DR_REG_APB_SARADC_BASE + 0x058)

/* APB_SARADC_TSENS_PU : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* description: */

#define APB_SARADC_TSENS_PU    (BIT(22))
#define APB_SARADC_TSENS_PU_M  (BIT(22))
#define APB_SARADC_TSENS_PU_V  0x1
#define APB_SARADC_TSENS_PU_S  22

/* APB_SARADC_TSENS_CLK_DIV : R/W ;bitpos:[21:14] ;default: 8'd6 ; */

/* description: */

#define APB_SARADC_TSENS_CLK_DIV    0x000000FF
#define APB_SARADC_TSENS_CLK_DIV_M  ((APB_SARADC_TSENS_CLK_DIV_V)<<(APB_SARADC_TSENS_CLK_DIV_S))
#define APB_SARADC_TSENS_CLK_DIV_V  0xFF
#define APB_SARADC_TSENS_CLK_DIV_S  14

/* APB_SARADC_TSENS_IN_INV : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* description: */

#define APB_SARADC_TSENS_IN_INV    (BIT(13))
#define APB_SARADC_TSENS_IN_INV_M  (BIT(13))
#define APB_SARADC_TSENS_IN_INV_V  0x1
#define APB_SARADC_TSENS_IN_INV_S  13

/* APB_SARADC_TSENS_OUT : RO ;bitpos:[7:0] ;default: 8'h0 ; */

/* description: */

#define APB_SARADC_TSENS_OUT    0x000000FF
#define APB_SARADC_TSENS_OUT_M  ((APB_SARADC_TSENS_OUT_V)<<(APB_SARADC_TSENS_OUT_S))
#define APB_SARADC_TSENS_OUT_V  0xFF
#define APB_SARADC_TSENS_OUT_S  0

#define APB_SARADC_APB_TSENS_CTRL2_REG          (DR_REG_APB_SARADC_BASE + 0x05C)

/* APB_SARADC_TSENS_CLK_SEL : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* description: */

#define APB_SARADC_TSENS_CLK_SEL    (BIT(15))
#define APB_SARADC_TSENS_CLK_SEL_M  (BIT(15))
#define APB_SARADC_TSENS_CLK_SEL_V  0x1
#define APB_SARADC_TSENS_CLK_SEL_S  15

/* APB_SARADC_TSENS_CLK_INV : R/W ;bitpos:[14] ;default: 1'b1 ; */

/* description: */

#define APB_SARADC_TSENS_CLK_INV    (BIT(14))
#define APB_SARADC_TSENS_CLK_INV_M  (BIT(14))
#define APB_SARADC_TSENS_CLK_INV_V  0x1
#define APB_SARADC_TSENS_CLK_INV_S  14

/* APB_SARADC_TSENS_XPD_FORCE : R/W ;bitpos:[13:12] ;default: 2'b0 ; */

/* description: */

#define APB_SARADC_TSENS_XPD_FORCE    0x00000003
#define APB_SARADC_TSENS_XPD_FORCE_M  ((APB_SARADC_TSENS_XPD_FORCE_V)<<(APB_SARADC_TSENS_XPD_FORCE_S))
#define APB_SARADC_TSENS_XPD_FORCE_V  0x3
#define APB_SARADC_TSENS_XPD_FORCE_S  12

/* APB_SARADC_TSENS_XPD_WAIT : R/W ;bitpos:[11:0] ;default: 12'h2 ; */

/* description: */

#define APB_SARADC_TSENS_XPD_WAIT    0x00000FFF
#define APB_SARADC_TSENS_XPD_WAIT_M  ((APB_SARADC_TSENS_XPD_WAIT_V)<<(APB_SARADC_TSENS_XPD_WAIT_S))
#define APB_SARADC_TSENS_XPD_WAIT_V  0xFFF
#define APB_SARADC_TSENS_XPD_WAIT_S  0

#define APB_SARADC_CALI_REG          (DR_REG_APB_SARADC_BASE + 0x060)

/* APB_SARADC_CALI_CFG : R/W ;bitpos:[16:0] ;default: 17'h8000 ; */

/* description: */

#define APB_SARADC_CALI_CFG    0x0001FFFF
#define APB_SARADC_CALI_CFG_M  ((APB_SARADC_CALI_CFG_V)<<(APB_SARADC_CALI_CFG_S))
#define APB_SARADC_CALI_CFG_V  0x1FFFF
#define APB_SARADC_CALI_CFG_S  0

#define APB_SARADC_APB_CTRL_DATE_REG          (DR_REG_APB_SARADC_BASE + 0x3fc)

/* APB_SARADC_DATE : R/W ;bitpos:[31:0] ;default: 32'h02007171 ; */

/* description: */

#define APB_SARADC_DATE    0xFFFFFFFF
#define APB_SARADC_DATE_M  ((APB_SARADC_DATE_V)<<(APB_SARADC_DATE_S))
#define APB_SARADC_DATE_V  0xFFFFFFFF
#define APB_SARADC_DATE_S  0

#endif /* __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_SARADC_H */
